app/controllers/fb_items_controller.rb

SELECT `fb_items`.* FROM `fb_items`  WHERE (user_id = 1 AND item_type Like 'photos')
---
  def index
    @fb_items = FbItem.all

SELECT  `fb_items`.* FROM `fb_items`  WHERE `fb_items`.`id` = ? LIMIT 1  [["id", 0]]
---
    def set_fb_item
      @fb_item = FbItem.find(params[:id])