app/controllers/users_controller.rb

SELECT `fb_items`.* FROM `fb_items`  WHERE `fb_items`.`user_id` = ?  [["user_id", 1]]
DELETE FROM `fb_items` WHERE `fb_items`.`id` = ?  [["id", 1]]
---
	def refresh_data
    	base_url = "https://graph.facebook.com/"
		field_albums = "name"
		time_field_likes_comments = "updated_time,comments.limit(1).summary(true),likes.limit(1).summary(true)"
		picture = "picture,"
		message = "message,"
		access_token = current_user.oauth_token
		user_id = "me"

    	# FETCH ALL ALBUM IDS
		album_id=0
		request_album_list_url = base_url+user_id+"/albums"+"?fields="+field_albums+"&access_token="+access_token
		puts "Making a HTTP request to "+ request_album_list_url
		json_response = fetch_paginated_data(request_album_list_url)
		json_response[:data].each{|item| album_id = item[:id] if item[:name]=="Profile Pictures" }

		# FETCH IMAGES, LIKES and COMMENTS
		profile_photos_array = []
		#FIXME :make a hash and use to URI
		request_images_likes_comments_url = base_url+album_id+"/photos"+"?fields="+picture+time_field_likes_comments+"&access_token="+access_token
		json_response = fetch_paginated_data(request_images_likes_comments_url)
		json_response[:data].each{|node| profile_photos_array.push({:picture_url => node[:picture], :fb_id => node[:id], :upload_time => node[:updated_time], :total_likes => node[:likes][:summary][:total_count], :total_comments => node[:comments][:summary][:total_count] }) }

		statuses_array = []
		#FIXME :make a hash and use to URI
		request_status_url = base_url+user_id+"/statuses"+"?fields="+message+time_field_likes_comments+"&access_token="+access_token
		json_response = fetch_paginated_data(request_status_url)
		json_response[:data].each{|node| statuses_array.push({:message => node[:message], :upload_time => node[:updated_time], :fb_id => node[:id], :total_likes => node[:likes]?node[:likes][:summary][:total_count]:0, :total_comments => node[:comments]?node[:comments][:summary][:total_count]:0 }) unless node[:message].nil?}

		current_user.fb_items.each do |item|
			item.destroy!

INSERT INTO `fb_items` (`comments_count`, `content`, `created_at`, `fb_id`, `fb_time`, `item_type`, `likes_count`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
			item.content = element[:picture_url]
			item.fb_time = element[:upload_time]
			item.item_type = "photo" #FIXME: Move to constants
			item.save!